app/controllers/movements_controller.rb

SELECT "movements".* FROM "movements" WHERE (date < '2013-12-18 14:02:00.616496')
---
  def index
    @movements = Movement.all

SELECT "movements".* FROM "movements" WHERE "movements"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @movement = Movement.find(params[:id])

SELECT "movements".* FROM "movements" WHERE "movements"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @movement = Movement.find(params[:id])

INSERT INTO "movements" ("amount", "created_at", "date", "subject", "type_movement", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    @movement = Movement.new(params[:movement])

    respond_to do |format|
      if @movement.save